In [80]:
import pandas as pd
import random
df = pd.read_excel('score.xlsx',index_col='지원번호')

In [81]:
df['요일'] = 0
df

       이름    학교    키   국어   영어   수학  과학  사회        SW특기  요일
지원번호
1번    강나래   구로고  197   90   85  100  95  85      Python   0
2번    강태원   구로고  184   40   35   50  55  25        Java   0
3번    강호림   구로고  168   80   75   70  80  75  Javascript   0
4번    김수찬   구로고  187   40   60   70  75  80         NaN   0
5번    김재욱   구로고  188   15   20   10  35  10         NaN   0
6번    박동현  디지털고  202   80  100   95  85  80           C   0
7번    박혜정  디지털고  188   55   65   45  40  35      PYTHON   0
8번    승근열  디지털고  190  100   85   90  95  95          C#   0

In [82]:
### 특정셀 부분을 수정
df.loc['1번','요일'] = 5
df.iloc[1,9] = 2
df

## 컬럼 전체를 수정
df['요일'] = 5

In [83]:
### 랜덤으로 0~6 사이에 랜덤숫자를 입력

# df.loc['1번','요일'] = random.randint(0,6)
# df.iloc[0,9] = random.randint(0,6)

# 랜덤으로 숫자입력
for i in range(8):
  df.iloc[i,9] = random.randint(0,6)

In [84]:
def func(x):
  if x == 0: return "일요일"
  elif x == 1: return "월요일"
  elif x == 2: return "화요일"
  elif x == 3: return "수요일"
  elif x == 4: return "목요일"
  elif x == 5: return "금요일"
  elif x == 6: return "토요일"

In [85]:
df['요일'].apply(func)

지원번호
1번    목요일
2번    화요일
3번    토요일
4번    금요일
5번    화요일
6번    수요일
7번    화요일
8번    월요일
Name: 요일, dtype: object

In [86]:
df['요일'] = df['요일'].apply(func)

In [87]:
## 결과 컬럼생성
df['결과'] = '불합격'

## 국어점수가 60점 이상이면 합격으로 수정
filt = df['국어'] >= 60
df.loc[filt,'결과'] = '합격'

In [88]:
## 학교 + 등학교
df['학교'] = df['학교'] + '등학교'

## 키 + cm
# astype() 타입 변경후, 문자열+문자열
df['키'] = df['키'].astype(str)+'cm'

In [89]:
df

       이름       학교      키   국어   영어   수학  과학  사회        SW특기   요일   결과
지원번호
1번    강나래   구로고등학교  197cm   90   85  100  95  85      Python  목요일   합격
2번    강태원   구로고등학교  184cm   40   35   50  55  25        Java  화요일  불합격
3번    강호림   구로고등학교  168cm   80   75   70  80  75  Javascript  토요일   합격
4번    김수찬   구로고등학교  187cm   40   60   70  75  80         NaN  금요일  불합격
5번    김재욱   구로고등학교  188cm   15   20   10  35  10         NaN  화요일  불합격
6번    박동현  디지털고등학교  202cm   80  100   95  85  80           C  수요일   합격
7번    박혜정  디지털고등학교  188cm   55   65   45  40  35      PYTHON  화요일  불합격
8번    승근열  디지털고등학교  190cm  100   85   90  95  95          C#  월요일   합격

* 컬럼이 숫자가 아니면 실행이 안됨
* mean(), max(), min(), std()

In [100]:
# df.groupby('학교')['이름'].count()
df.groupby('학교')['국어'].mean()
df.groupby('학교')['국어'].count()
df.groupby('학교')['국어'].sum().sort_values(ascending=False)

학교
구로고등학교     265
디지털고등학교    235
Name: 국어, dtype: int64

In [103]:
df['학년'] = [3,3,2,1,1,3,2,2]

In [104]:
df.groupby(['학교','학년'])['국어'].agg(['mean','min','max','sum'])

            mean  min  max  sum
학교      학년
구로고등학교  1   27.5   15   40   55
        2   80.0   80   80   80
        3   65.0   40   90  130
디지털고등학교 2   77.5   55  100  155
        3   80.0   80   80   80

In [105]:
df = pd.read_csv('chipotle.tsv',sep="\t")

In [107]:
df.shape

(4622, 5)

In [108]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [109]:
df = pd.read_csv('drinks.csv')

In [111]:
df.shape

(193, 6)

In [112]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     170 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.2+ KB

In [115]:
### 모든 술의 총량을 출력.
### total_servings 컬럼 만들기 (beer+spirit+wine)
#  전체 알코올 도수를 확인

df['total_servings'] = df['beer_servings']+df['spirit_servings']+df['wine_servings']

In [125]:
df['continent'].unique()

array(['AS', 'EU', 'AF', nan, 'SA', 'OC'], dtype=object)

In [129]:
filt = df['continent'].isnull()
df.loc[filt,'total_servings'].sum()

np.int64(0)

In [ ]:
## continent의 NaN값을 OT로 변경
df['continent'] = df['continent'].fillna('OT')

In [130]:
### 대륙별 술 totoal_servings를 구하시오.
df.groupby('continent')['total_servings'].sum().sort_values()

continent
OC     2940
SA     4227
AS     4706
AF     4986
OT     7721
EU    21085
Name: total_servings, dtype: int64

In [131]:
df.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent', 'total_servings'],
      dtype='object')

In [136]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 8 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
 6   total_servings                193 non-null    int64
 7   alcohol_rate                  193 non-null    int64
dtypes: float64(1), int64(5), object(2)
memory usage: 12.2+ KB

In [148]:
### 술 소비량 대비 알콜 비율이 어느정도 되는지 출력.
## 알콜 비율을 계산해서 'alcohol_rate'컬럼을 추가
## total_litres_of_pure_alcohol : 알콜 비율 -> total_servings으로 나눈것
df['alcohol_rate'] = (df['total_litres_of_pure_alcohol']) / (df['total_servings'])

## 술 소비량 대비 알콜비율이 높은 나라별 20개 출력
# df['alcohol_rate'].fillna(0,inplace=True)
df[['country','alcohol_rate']].sort_values('alcohol_rate',ascending=False).head(20)

## 대륙별 알콜비율도 계산해서 출력 (평균내면됨)
df.groupby('continent')['alcohol_rate'].sum().sort_values(ascending=False)

continent
AF    2.636258
EU    0.788717
AS    0.719797
OT    0.410644
OC    0.270327
SA    0.214415
Name: alcohol_rate, dtype: float64

In [155]:
df[['country','alcohol_rate']].sort_values('alcohol_rate',ascending=False).head()

          country  alcohol_rate
63         Gambia      0.266667
153  Sierra Leone      0.223333
124       Nigeria      0.185714
179        Uganda      0.153704
142        Rwanda      0.151111

In [152]:
### kor가 포함되어 있는 나라를 출력
filt = df['country'].str.lower().str.contains('kor')
df[filt][['country','alcohol_rate']]

         country  alcohol_rate
46   North Korea           NaN
138  South Korea      0.059394

In [141]:
df

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,total_servings,alcohol_rate
0,Afghanistan,0,0,0,0.0,AS,0,NaN
1,Albania,89,132,54,4.9,EU,275,0.017818
2,Algeria,25,0,14,0.7,AF,39,0.017949
3,Andorra,245,138,312,12.4,EU,695,0.017842
4,Angola,217,57,45,5.9,AF,319,0.018495
...,...,...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA,436,0.017661
189,Vietnam,111,2,1,2.0,AS,114,0.017544
190,Yemen,6,0,0,0.1,AS,6,0.016667
191,Zambia,32,19,4,2.5,AF,55,0.045455
192,Zimbabwe,64,18,4,4.7,AF,86,0.054651